; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared5 - mode
	image6 - mode
	spectrograph4 - mode
	infrared2 - mode
	image1 - mode
	thermograph0 - mode
	thermograph3 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Star3 - direction
	Star5 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph3)
	(supports instrument0 infrared5)
	(supports instrument0 image1)
	(supports instrument0 infrared2)
	(supports instrument0 spectrograph4)
	(supports instrument0 image6)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
)
(:goal (and
	(have_image Phenomenon11 image6)
	(have_image Phenomenon11 infrared5)
	(have_image Planet12 thermograph3)
	(have_image Planet12 infrared2)
	(have_image Planet13 image6)
	(have_image Planet13 thermograph3)
	(have_image Star14 image1)
	(have_image Star14 infrared2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
2. (turn_to satellite0 phenomenon11 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon11)
   goals met: 0 of 8
3. (turn_to satellite0 star5 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star5)
   goals met: 0 of 8
4. (calibrate satellite0 instrument0 star5)
   added: (calibrated instrument0)
   goals met: 0 of 8
5. (turn_to satellite0 phenomenon11 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon11)
   goals met: 0 of 8
6. (take_image satellite0 phenomenon11 instrument0 image6)
   added: (have_image phenomenon11 image6)
   goals met: 1 of 8
7. (take_image satellite0 phenomenon11 instrument0 infrared5)
   added: (have_image phenomenon11 infrared5)
   goals met: 2 of 8
8. (turn_to satellite0 planet12 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet12)
   goals met: 2 of 8
9. (take_image satellite0 planet12 instrument0 infrared2)
   added: (have_image planet12 infrared2)
   goals met: 3 of 8
10. (take_image satellite0 planet12 instrument0 thermograph3)
   added: (have_image planet12 thermograph3)
   goals met: 4 of 8
11. (turn_to satellite0 planet13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet13)
   goals met: 4 of 8
12. (take_image satellite0 planet13 instrument0 image6)
   added: (have_image planet13 image6)
   goals met: 5 of 8
13. (take_image satellite0 planet13 instrument0 thermograph3)
   added: (have_image planet13 thermograph3)
   goals met: 6 of 8
14. (turn_to satellite0 star14 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star14)
   goals met: 6 of 8
15. (take_image satellite0 star14 instrument0 image1)
   added: (have_image star14 image1)
   goals met: 7 of 8
16. (take_image satellite0 star14 instrument0 infrared2)
   added: (have_image star14 infrared2)
   goals met: 8 of 8
